thinnect/tos-platforms/tos/platforms/efm32/radio/rail_lib/apps/railtest/app_main.c
/***************************************************************************//**
 * @file app_main.c
 * @brief This is the base test application. It handles basic RAIL configuration
 * as well as transmit, receive, and various debug modes.
 * @copyright Copyright 2015 Silicon Laboratories, Inc. http://www.silabs.com
 ******************************************************************************/

#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "rail.h"
#include "rail_ieee802154.h"
#include "rail_types.h"
#include "rail_chip_specific.h"
#include "rail_assert_error_codes.h"

#include "em_chip.h"
#include "em_core.h"
#include "em_rmu.h"

#include "retargetserial.h"
#include "gpiointerrupt.h"
#ifdef EMBER_AF_PLUGIN_LCD_GRAPHICS
#include "graphics.h"
#endif
#include "command_interpreter.h"
#include "response_print.h"
#include "buffer_pool_allocator.h"
#include "circular_queue.h"

#include "rail_config.h"

#ifdef CONFIGURATION_HEADER
#include CONFIGURATION_HEADER
#endif

#include "app_ci.h"
#include "app_common.h"
#include "app_trx.h"

#include "bsp.h"

// Includes for Silicon Labs-only, internal testing
#ifdef RPC_TESTING
#include "vs_rpc.h"
#else
#define RPC_Server_Init()
#define RPC_Server_Tick()
#endif

// Configuration defines
#ifndef APP_MAX_PACKET_LENGTH
#define APP_MAX_PACKET_LENGTH  (MAX_BUFFER_SIZE - sizeof(RxPacketData_t))
#endif
#ifndef TX_BUFFER_SIZE
#define TX_BUFFER_SIZE         512
#endif
#ifndef APP_CONTINUOUS_TRANSFER_PERIOD
#define APP_CONTINUOUS_TRANSFER_PERIOD 250UL
#endif
#ifndef APP_COMMAND_INTERFACE_BUFFER_SIZE
#define APP_COMMAND_INTERFACE_BUFFER_SIZE 256
#endif
#ifndef EVENT_QUEUE_SIZE
#define EVENT_QUEUE_SIZE 10
#endif

// External control and status variables
Counters_t counters = { 0 };
bool receiveModeEnabled = false;
RAIL_RadioState_t rxSuccessTransition = RAIL_RF_STATE_IDLE;
uint8_t logLevel = PERIPHERAL_ENABLE | ASYNC_RESPONSE;
int32_t txCount = 0;
uint32_t continuousTransferPeriod = APP_CONTINUOUS_TRANSFER_PERIOD;
uint32_t txAfterRxDelay = 0;
int32_t txCancelDelay = -1;
bool skipCalibrations = false;
bool afterRxCancelAck = false;
bool afterRxUseTxBufferForAck = false;
bool schRxStopOnRxEvent = false;
uint32_t rssiDoneCount = 0; // HW rssi averaging
float averageRssi = -128;
bool printTxAck = false;

// Internal app state variables
static bool receivingPacket = false;
RAIL_Events_t lastTxStatus = 0;
RAIL_Events_t lastTxAckStatus = 0;
static uint32_t startTransmitCounter = 0;
uint32_t internalTransmitCounter = 0;
uint32_t failPackets = 0;
uint32_t failAckPackets = 0;
uint32_t sentAckPackets = 0;
static bool packetTx = false;
static bool finishTxSequence = false;
static bool finishTxAckSequence = false;
RAIL_ScheduleTxConfig_t nextPacketTxTime = {
  0,
  RAIL_TIME_ABSOLUTE,
  RAIL_SCHEDULED_TX_DURING_RX_POSTPONE_TX
};
Queue_t  rxPacketQueue;
static uint32_t railTimerExpireTime = 0;
static uint32_t railTimerConfigExpireTime = 0;
static bool     railTimerExpired = false;
static bool     calibrateRadio = false;
bool newTxError = false;
static bool     rxAckTimeout = false;
static uint32_t ackTimeoutDuration = 0;
EventData_t eventQueue[EVENT_QUEUE_SIZE];
uint8_t eventQueueMarker = 0;
uint32_t enablePrintEvents = 0;
uint32_t eventsMissed = 0;
uint8_t lastSetTxPowerLevel = HAL_PA_POWER;

// Names of RAIL_EVENT defines. This should align with rail_types.h
const char* eventNames[] = {
  "RSSI_AVERAGE_DONE",
  "RX_ACK_TIMEOUT",
  "RX_FIFO_ALMOST_FULL",
  "RX_PACKET_RECEIVED",
  "RX_PREAMBLE_DETECT",
  "RX_SYNC1_DETECT",
  "RX_SYNC2_DETECT",
  "RX_FRAME_ERROR",
  "RX_FIFO_OVERFLOW",
  "RX_ADDRESS_FILTERED",
  "RX_TIMEOUT",
  "RX_SCHEDULED_RX_END",
  "RX_PACKET_ABORTED",
  "RX_FILTER_PASSED",
  "RX_TIMING_LOST",
  "RX_TIMING_DETECT",
  "IEEE802154_DATA_REQUEST_COMMAND",
  "TX_FIFO_ALMOST_EMPTY",
  "TX_PACKET_SENT",
  "TXACK_PACKET_SENT",
  "TX_ABORTED",
  "TXACK_ABORTED",
  "TX_BLOCKED",
  "TXACK_BLOCKED",
  "TX_UNDERFLOW",
  "TXACK_UNDERFLOW",
  "TX_CHANNEL_CLEAR",
  "TX_CHANNEL_BUSY",
  "TX_CCA_RETRY",
  "TX_START_CCA",
  "CONFIG_UNSCHEDULED",
  "CONFIG_SCHEDULED",
  "SCHEDULED_STATUS"
  "CAL_NEEDED",
};

// Allow local echo to be turned on/off for the command prompt
#ifdef DISABLE_LOCAL_ECHO
  #define localEcho 0
#else
  #define localEcho 1
#endif

//Command line variables
static CommandEntry_t commands[] = {
  APP_CI_COMMANDS,
  COMMAND_ENTRY(NULL, NULL, NULL, NULL)
};
static CommandState_t ciState;
static char ciBuffer[APP_COMMAND_INTERFACE_BUFFER_SIZE];

// Channel Variables
uint16_t channel = 0;

// Generic
RAIL_Handle_t railHandle;

uint8_t txData[APP_MAX_PACKET_LENGTH] = {
  0x0F, 0x0E, 0x11, 0x22, 0x33, 0x44, 0x55, 0x66,
  0x77, 0x88, 0x99, 0xAA, 0xBB, 0xCC, 0xDD, 0xEE,
};
uint16_t txDataLen = 16;

static uint8_t txFifo[TX_BUFFER_SIZE];

uint8_t ackData[RAIL_AUTOACK_MAX_LENGTH] = {
  0x0F, 0x0E, 0xF1, 0xE2, 0xD3, 0xC4, 0xB5, 0xA6,
  0x97, 0x88, 0x79, 0x6A, 0x5B, 0x4C, 0x3D, 0x2E,
};
uint8_t ackDataLen = 16;

// Helper buffer for printing received packet data
static char packetPrintBuffer[(APP_MAX_PACKET_LENGTH + 1) * 5];

// Static RAIL callbacks
static void RAILCb_RfReady(RAIL_Handle_t railHandle);
static void RAILCb_IEEE802154_DataRequestCommand(RAIL_Handle_t railHandle);
static void RAILCb_RssiAverageDone(RAIL_Handle_t railHandle);
static void RAILCb_Event(RAIL_Handle_t railHandle, RAIL_Events_t events);
static void RAILCb_RadioConfigChanged(RAIL_Handle_t railHandle,
                                      const RAIL_ChannelConfigEntry_t *entry);

static RAIL_Config_t railCfg = {
  .eventsCallback = &RAILCb_Event
};

// Structure that holds txOptions
RAIL_TxOptions_t txOptions;

// If this pointer is NULL, pass in 0 to StartTx
RAIL_TxOptions_t *txOptionsPtr = NULL;

// Data Management
RAIL_DataConfig_t railDataConfig = {
  .txSource = TX_PACKET_DATA,
  .rxSource = RX_PACKET_DATA,
  .txMethod = PACKET_MODE,
  .rxMethod = PACKET_MODE,
};

// Called during main loop
void processInputCharacters(void);
void sendPacketIfPending(void);
void finishTxSequenceIfPending(void);
void changeAppModeIfPending(void);
void printReceivedPacket(void);
void printNewTxError(void);
void checkTimerExpiration(void);
void updateDisplay(void);
void processPendingCalibrations(void);
void printAckTimeout(void);
void printEvents(void);

int main(void)
{
  // Initialize the chip
  CHIP_Init();

  // Initialize the RPC Server
  RPC_Server_Init();

