thinnect/tos-platforms/tos/platforms/efm32/radio/rail_lib/apps/railtest/app_main.c
  // Grab the reset cause
  uint32_t resetCause = RMU_ResetCauseGet();
  RMU_ResetCauseClear(); // So resetCause is rational and not an accmulated mess
  // Release GPIOs that were held by EM4h
  // This is reportedly a workaround that I've found needs to be done
  // *before* appHalInit() tries to start oscillators, otherwise we'll
  // hang indefinitely waiting for the oscillator to become ready.
  if (resetCause & RMU_RSTCAUSE_EM4RST) {
    EMU->CMD = EMU_CMD_EM4UNLATCH;
  }

  // Initialize hardware for application
  appHalInit();

  // Initialize Radio
  railHandle = RAIL_Init(&railCfg, &RAILCb_RfReady);

  // Initialize the PA now that the HFXO is up and the timing is correct
  RAIL_TxPowerConfig_t txPowerConfig = {
#if HAL_PA_2P4_LOWPOWER
    .mode = RAIL_TX_POWER_MODE_2P4_LP,
#else
    .mode = RAIL_TX_POWER_MODE_2P4_HP,
#endif
    .voltage = HAL_PA_VOLTAGE,
    .rampTime = HAL_PA_RAMP,
  };
  if (channelConfigs[0]->configs[0].baseFrequency < 1000000UL) {
    // Use the Sub-GHz PA if required
    txPowerConfig.mode = RAIL_TX_POWER_MODE_SUBGIG;
  }
  if (RAIL_ConfigTxPower(railHandle, &txPowerConfig) != RAIL_STATUS_NO_ERROR) {
    // Error: The PA could not be initialized due to an improper configuration.
    // Please ensure your configuration is valid for the selected part.
    while (1) ;
  }
  // Set default TX power
  RAIL_SetTxPower(railHandle, HAL_PA_POWER);

  // Set TX FIFO, and verify that the size is correct
  uint16_t fifoSize = RAIL_SetTxFifo(railHandle, txFifo, 0, TX_BUFFER_SIZE);
  if (fifoSize != TX_BUFFER_SIZE) {
    while (1) ;
  }

  // Initialize Radio Calibrations
  RAIL_ConfigCal(railHandle, RAIL_CAL_ALL);

  // Load the channel configuration for the generated radio settings
  RAIL_ConfigChannels(railHandle, channelConfigs[0], &RAILCb_RadioConfigChanged);

  // Configure all RAIL events with appended info
  RAIL_Events_t events = RAIL_EVENT_CAL_NEEDED
                         | RAIL_EVENT_RSSI_AVERAGE_DONE
                         | RAIL_EVENT_RX_ACK_TIMEOUT
                         | RAIL_EVENT_RX_FIFO_ALMOST_FULL
                         | RAIL_EVENT_TX_FIFO_ALMOST_EMPTY
                         | RAIL_EVENT_RX_PACKET_RECEIVED
                         | RAIL_EVENT_TX_PACKET_SENT
                         | RAIL_EVENT_TXACK_PACKET_SENT
                         | RAIL_EVENT_IEEE802154_DATA_REQUEST_COMMAND
                         | RAIL_EVENT_RX_PREAMBLE_DETECT
                         | RAIL_EVENT_RX_SYNC1_DETECT
                         | RAIL_EVENT_RX_SYNC2_DETECT
                         | RAIL_EVENT_RX_FRAME_ERROR
                         | RAIL_EVENT_RX_FIFO_OVERFLOW
                         | RAIL_EVENT_RX_ADDRESS_FILTERED
                         | RAIL_EVENT_RX_TIMEOUT
                         | RAIL_EVENT_RX_SCHEDULED_RX_END
                         | RAIL_EVENT_RX_PACKET_ABORTED
                         | RAIL_EVENT_RX_FILTER_PASSED
                         | RAIL_EVENT_TX_CHANNEL_BUSY
                         | RAIL_EVENT_TX_ABORTED
                         | RAIL_EVENT_TX_BLOCKED
                         | RAIL_EVENT_TX_UNDERFLOW
                         | RAIL_EVENT_TXACK_ABORTED
                         | RAIL_EVENT_TXACK_BLOCKED
                         | RAIL_EVENT_TXACK_UNDERFLOW
                         | RAIL_EVENT_TX_CHANNEL_CLEAR
                         | RAIL_EVENT_TX_CCA_RETRY
                         | RAIL_EVENT_TX_START_CCA;
  RAIL_ConfigEvents(railHandle, RAIL_EVENTS_ALL, events);
  RAIL_ConfigRxOptions(railHandle, RAIL_RX_OPTIONS_ALL, RAIL_RX_OPTIONS_DEFAULT);

  RAIL_StateTransitions_t transitions = {
    .success = RAIL_RF_STATE_RX,
    .error = RAIL_RF_STATE_RX
  };
  RAIL_SetRxTransitions(railHandle, &transitions);
  rxSuccessTransition = RAIL_RF_STATE_RX;
  RAIL_SetTxTransitions(railHandle, &transitions);
  // Initialize the queue we use for tracking packets
  if (!queueInit(&rxPacketQueue, MAX_QUEUE_LENGTH)) {
    while (1) ;
  }

  updateDisplay();

  printf("\n"APP_DEMO_STRING_INIT "\n");
  if (resetCause & RMU_RSTCAUSE_EM4RST) {
    responsePrint("sleepWoke", "EM:4%c,SerialWakeup:No,RfSensed:%s",
                  (((EMU->EM4CTRL & EMU_EM4CTRL_EM4STATE)
                    == EMU_EM4CTRL_EM4STATE_EM4S) ? 's' : 'h'),
                  RAIL_IsRfSensed(railHandle) ? "Yes" : "No");
  }
  printf("> ");
  ciInitState(&ciState, ciBuffer, sizeof(ciBuffer), commands);

  // Fill out the txPacket with a useful pattern so it's not
  // all-zeros if user extends the Tx length.
  for (unsigned int i = txDataLen; i < sizeof(txData); i++) {
    txData[i] = i;
  }

  // Initialize autoack data
  RAIL_WriteAutoAckFifo(railHandle, ackData, ackDataLen);

  RAIL_StartRx(railHandle, channel, NULL); // Start in receive mode
  receiveModeEnabled = true;
  while (1) {
    RPC_Server_Tick();

    processInputCharacters();

    rfSensedCheck();

    sendPacketIfPending();

    finishTxSequenceIfPending();

    changeAppModeIfPending();

    printReceivedPacket();

    printNewTxError();

    printEvents();

    checkTimerExpiration();

    updateDisplay();

    processPendingCalibrations();

    printAckTimeout();
  }
} //main()

/******************************************************************************
 * RAIL Callback Implementation
 *****************************************************************************/
static void RAILCb_RfReady(RAIL_Handle_t railHandle)
{
  LedSet(0);
  LedSet(1);
}

void RAILCb_TimerExpired(RAIL_Handle_t railHandle)
{
  if (inAppMode(NONE, NULL)) {
    if (abortRxDelay != 0) {
      RAIL_Idle(railHandle, RAIL_IDLE_ABORT, true);
    } else {
      railTimerExpireTime = RAIL_GetTime();
      railTimerConfigExpireTime = RAIL_GetTimer(railHandle);
      railTimerExpired = true;
    }
  } else if (currentAppMode() == PER) {
    GPIO_PinOutToggle(PER_PORT, PER_PIN);
    counters.perTriggers += GPIO_PinOutGet(PER_PORT, PER_PIN);
    perCount -= GPIO_PinOutGet(PER_PORT, PER_PIN);
    if (perCount < 1) {
      GPIO_PinOutClear(PER_PORT, PER_PIN);
      enableAppMode(PER, false, NULL);
    } else {
      RAIL_SetTimer(railHandle, perDelay, RAIL_TIME_DELAY, &RAILCb_TimerExpired);
    }
  } else {
    pendPacketTx();
  }
}

