thinnect/tos-platforms/tos/platforms/efm32/radio/rail_lib/apps/railtest/app_main.c
static void RAILCb_IEEE802154_DataRequestCommand(RAIL_Handle_t railHandle)
{
  RAIL_IEEE802154_Address_t address;
  if (RAIL_IEEE802154_GetAddress(railHandle, &address)
      != RAIL_STATUS_NO_ERROR) {
    return;
  }
  // Placeholder validation for when a data request should have the frame
  // pending bit set in the ACK.
  if (address.length == RAIL_IEEE802154_LongAddress) {
    if (address.longAddress[0] == 0xAA) {
      RAIL_IEEE802154_SetFramePending(railHandle);
    }
  } else {
    if ((address.shortAddress & 0xFF) == 0xAA) {
      RAIL_IEEE802154_SetFramePending(railHandle);
    }
  }
}

static void RAILCb_RssiAverageDone(RAIL_Handle_t railHandle)
{
  char bufAverageRssi[10];
  int16_t avgRssi = RAIL_GetAverageRssi(railHandle);
  rssiDoneCount++;
  averageRssi = (float)avgRssi / 4;
  if (avgRssi == RAIL_RSSI_INVALID) {
    responsePrint("getAvgRssi", "Could not read RSSI.");
    return;
  }

  sprintfFloat(bufAverageRssi, sizeof(bufAverageRssi), averageRssi, 2);
  responsePrint("getAvgRssi", "rssi:%s", bufAverageRssi);
}

void RAILCb_AssertFailed(RAIL_Handle_t railHandle, uint32_t errorCode)
{
  static const char* railErrorMessages[] = RAIL_ASSERT_ERROR_MESSAGES;
  const char *errorMessage = "Unknown";

  // If this error code is within the range of known error messages then use
  // the appropriate error message.
  if (errorCode < (sizeof(railErrorMessages) / sizeof(char*))) {
    errorMessage = railErrorMessages[errorCode];
  }
  // Print a message about the assert that triggered
  responsePrint("assert",
                "code:%d,message:%s",
                errorCode,
                errorMessage);
  // Reset the chip since an assert is a fatal error
  NVIC_SystemReset();
}

static void RAILCb_RadioConfigChanged(RAIL_Handle_t railHandle,
                                      const RAIL_ChannelConfigEntry_t *entry)
{
  // Ensure that the correct PA is configured for use. If it is correct,
  // we don't need to do anything as RAIL library takes care of setting
  // the power level according to channel limits. If the PA needs to change
  // however, the app needs to make that change explicitly and re-set the
  // power.
  RAIL_TxPowerConfig_t txConfig;
  RAIL_GetTxPowerConfig(railHandle, &txConfig);
  if (((entry->baseFrequency > 1000000000UL)
       && (txConfig.mode == RAIL_TX_POWER_MODE_SUBGIG))
      || ((entry->baseFrequency < 1000000000UL)
          && (txConfig.mode == RAIL_TX_POWER_MODE_2P4_HP
              || txConfig.mode == RAIL_TX_POWER_MODE_2P4_LP))) {
    // Get the power that the user wanted, regardless of channel power limit
    // We don't care what was actually set, because that could have been some
    // value limited by the previous channel
    RAIL_TxPower_t lastSetTxPower = RAIL_ConvertRawToDbm(railHandle, txConfig.mode, lastSetTxPowerLevel);

    txConfig.mode = (entry->baseFrequency > 1000000000UL) ? RAIL_TX_POWER_MODE_2P4_HP : RAIL_TX_POWER_MODE_SUBGIG;
    if (RAIL_ConfigTxPower(railHandle, &txConfig) != RAIL_STATUS_NO_ERROR) {
      // Error: The PA could not be initialized due to an improper configuration.
      // Please ensure your configuration is valid for the selected part.
      while (1) ;
    }

    // If you change the PA's, you must explicitly set the power to the desired value
    if (lastSetTxPower > entry->maxPower) {
      RAIL_SetTxPowerDbm(railHandle, entry->maxPower);
    } else {
      RAIL_SetTxPowerDbm(railHandle, lastSetTxPower);
    }
  }
  counters.radioConfigChanged++;
}

static void RAILCb_Event(RAIL_Handle_t railHandle, RAIL_Events_t events)
{
  enqueueEvents(events);
  if (events & RAIL_EVENT_CAL_NEEDED) {
    calibrateRadio = true;
  }
  if (events & RAIL_EVENT_RSSI_AVERAGE_DONE) {
    RAILCb_RssiAverageDone(railHandle);
  }

  // RX Events
  if (events & RAIL_EVENT_RX_TIMING_DETECT) {
    counters.timingDetect++;
  }
  if (events & RAIL_EVENT_RX_TIMING_LOST) {
    counters.timingLost++;
  }
  if (events & RAIL_EVENT_RX_PREAMBLE_DETECT) {
    counters.preambleDetect++;
  }
  if (events & RAIL_EVENT_RX_SYNC1_DETECT) {
    receivingPacket = true;
    counters.syncDetect++;
    rxFifoPrep();
    if (abortRxDelay != 0) {
      RAIL_SetTimer(railHandle, abortRxDelay, RAIL_TIME_DELAY, &RAILCb_TimerExpired);
    }
  }
  if (events & RAIL_EVENT_IEEE802154_DATA_REQUEST_COMMAND) {
    RAILCb_IEEE802154_DataRequestCommand(railHandle);
  }
  if (events & RAIL_EVENT_RX_FIFO_ALMOST_FULL) {
    RAILCb_RxFifoAlmostFull(railHandle);
  }
  if (events & (RAIL_EVENT_RX_FIFO_OVERFLOW
                | RAIL_EVENT_RX_ADDRESS_FILTERED
                | RAIL_EVENT_RX_PACKET_ABORTED
                | RAIL_EVENT_RX_FRAME_ERROR
                | RAIL_EVENT_RX_PACKET_RECEIVED)) {
    // All of the above events cause a packet to not be received
    receivingPacket = false;
    if (rxFifoManual && (railDataConfig.rxMethod != PACKET_MODE)) {
      (void) RAIL_HoldRxPacket(railHandle);
    }
    if (events & RAIL_EVENT_RX_FIFO_OVERFLOW) {
      counters.rxOfEvent++;
    }
    if (events & RAIL_EVENT_RX_ADDRESS_FILTERED) {
      counters.addrFilterEvent++;
    }
    if (events & RAIL_EVENT_RX_PACKET_ABORTED) {
      counters.rxFail++;
    }
    if (events & RAIL_EVENT_RX_FRAME_ERROR) {
      counters.frameError++;
    }
    if (events & RAIL_EVENT_RX_PACKET_RECEIVED) {
      RAILCb_RxPacketReceived(railHandle);
    }
  }
  if (events & RAIL_EVENT_RX_ACK_TIMEOUT) {
    counters.ackTimeout++;
    rxAckTimeout = true;
    ackTimeoutDuration = RAIL_GetTime()
                         - previousTxAppendedInfo.timeSent.packetTime;
  }
  // End scheduled receive mode if an appropriate end or error event is received
  if ((events & RAIL_EVENT_RX_SCHEDULED_RX_END)
      || ((schRxStopOnRxEvent && inAppMode(RX_SCHEDULED, NULL))
          && (events & RAIL_EVENT_RX_ADDRESS_FILTERED
              || events & RAIL_EVENT_RX_FIFO_OVERFLOW
              || events & RAIL_EVENT_RX_FRAME_ERROR))) {
    enableAppMode(RX_SCHEDULED, false, NULL);
  }

  // TX Events
  if (events & RAIL_EVENT_TX_START_CCA) {
    counters.lbtStartCca++;
  }
  if (events & RAIL_EVENT_TX_CCA_RETRY) {
    counters.lbtRetry++;
  }
  if (events & RAIL_EVENT_TX_CHANNEL_CLEAR) {
    counters.lbtSuccess++;
  }
  if (events & (RAIL_EVENT_TX_ABORTED
                | RAIL_EVENT_TX_BLOCKED
                | RAIL_EVENT_TX_UNDERFLOW
                | RAIL_EVENT_TX_CHANNEL_BUSY)) {
    lastTxStatus = events;
    newTxError = true;
    failPackets++;
    scheduleNextTx();

    // Increment counters for TX events
    if (events & RAIL_EVENT_TX_ABORTED) {
      counters.userTxAborted++;
    }
    if (events & RAIL_EVENT_TX_BLOCKED) {
      counters.userTxBlocked++;
    }
    if (events & RAIL_EVENT_TX_UNDERFLOW) {
      counters.userTxUnderflow++;
    }
  }
  // Put this here too so that we do these things twice
  // in the case that an ack and a non ack failure have
  // been queued up
  if (events & (RAIL_EVENT_TXACK_ABORTED
                | RAIL_EVENT_TXACK_BLOCKED
                | RAIL_EVENT_TXACK_UNDERFLOW)) {
    lastTxAckStatus = events;
    failAckPackets++;
    pendFinishTxAckSequence();

