thinnect/tos-platforms/tos/platforms/efm32/radio/rail_lib/apps/railtest/app_main.c
    // Increment counters for TXACK events
    if (events & RAIL_EVENT_TXACK_ABORTED) {
      counters.ackTxAborted++;
    }
    if (events & RAIL_EVENT_TXACK_BLOCKED) {
      counters.ackTxBlocked++;
    }
    if (events & RAIL_EVENT_TXACK_UNDERFLOW) {
      counters.ackTxUnderflow++;
    }
  }
  if (events & RAIL_EVENT_TX_FIFO_ALMOST_EMPTY) {
    RAILCb_TxFifoAlmostEmpty(railHandle);
  }
  if (events & RAIL_EVENT_TX_PACKET_SENT) {
    counters.userTx++;
    RAILCb_TxPacketSent(railHandle, false);
  }
  if (events & RAIL_EVENT_TXACK_PACKET_SENT) {
    counters.ackTx++;
    RAILCb_TxPacketSent(railHandle, true);
  }
}
/******************************************************************************
 * Application Helper Functions
 *****************************************************************************/
void processPendingCalibrations()
{
  // Only calibrate the radio when not currently transmitting or in a
  // transmit mode. Also don't try to calibrate while receiving a packet
  bool calsInMode = inAppMode(NONE, NULL);
  if (calibrateRadio && calsInMode && !skipCalibrations && !receivingPacket) {
    RAIL_CalMask_t pendingCals = RAIL_GetPendingCal(railHandle);

    // Disable the radio if we have to do an offline calibration
    if (pendingCals & RAIL_CAL_OFFLINE) {
      RAIL_Idle(railHandle, RAIL_IDLE_ABORT, false);
    }

    // Perform the necessary calibrations and don't save the results
    counters.calibrations++;
    calibrateRadio = false;
    RAIL_Calibrate(railHandle, NULL, pendingCals);

    // Turn the radio back on if we disabled it above
    if ((pendingCals & RAIL_CAL_OFFLINE)) {
      // Wait for RxStart to succeed
      while (receiveModeEnabled && RAIL_StartRx(railHandle, channel, NULL)) {
        RAIL_Idle(railHandle, RAIL_IDLE_ABORT, false);
      }
    }
  }
}

void checkTimerExpiration()
{
  if (railTimerExpired) {
    railTimerExpired = false;
    responsePrint("timerCb",
                  "TimerExpiredCallback:%u,ConfiguredExpireTime:%u",
                  railTimerExpireTime,
                  railTimerConfigExpireTime);
  }
}

void printNewTxError()
{
  if (newTxError) {
    newTxError = false;
    if (lastTxStatus & RAIL_EVENT_TX_UNDERFLOW) {
      if (logLevel & ASYNC_RESPONSE) {
        responsePrint("txPacket",
                      "txStatus:Error,"
                      "errorReason:Tx underflow or abort,"
                      "errorCode:0x%x",
                      lastTxStatus);
      }
    }
    if (lastTxStatus & RAIL_EVENT_TX_CHANNEL_BUSY) {
      if (logLevel & ASYNC_RESPONSE) {
        responsePrint("txPacket",
                      "txStatus:Error,"
                      "errorReason:Tx channel busy,"
                      "errorCode:0x%x",
                      lastTxStatus);
      }
      counters.txChannelBusy++;
    }
  }
}

void printAckTimeout()
{
  if (rxAckTimeout) {
    rxAckTimeout = false;
    responsePrint("rxAckTimeout",
                  "ackTimeoutDuration:%d",
                  ackTimeoutDuration);
  }
}

void changeChannel(uint32_t i)
{
  channel = i;
  redrawDisplay = true;
  // Automatically apply the new channel to future Tx/Rx
  if (receiveModeEnabled) {
    RAIL_StartRx(railHandle, channel, NULL);
  }
}

void pendPacketTx()
{
  packetTx = true;
}

uint8_t chooseTxType(bool reuseCcaConfig)
{
  RAIL_TxOptions_t currentOptions = txOptionsPtr == NULL ? 0 : *txOptionsPtr;
  if (currentAppMode() == TX_SCHEDULED || currentAppMode() == SCHTX_AFTER_RX) {
    return RAIL_StartScheduledTx(railHandle, channel, currentOptions, &nextPacketTxTime, NULL);
  } else if (txType == TX_TYPE_LBT) {
    // Sending NULL for txPreTxOpArgs reuses previous arguments, which
    // saves computation.
    return RAIL_StartCcaLbtTx(railHandle, channel, currentOptions, reuseCcaConfig ? NULL : lbtConfig, NULL);
  } else if (txType == TX_TYPE_CSMA) {
    return RAIL_StartCcaCsmaTx(railHandle, channel, currentOptions, reuseCcaConfig ? NULL : csmaConfig, NULL);
  } else {
    return RAIL_StartTx(railHandle, channel, currentOptions, NULL);
  }
}

void sendPacketIfPending()
{
  if (packetTx) {
    packetTx = false;
    uint8_t txStatus;
    uint32_t storedTransmitCounter = internalTransmitCounter;

    // Don't decrement in continuous mode
    if (currentAppMode() != TX_CONTINUOUS) {
      txCount--;
    }

    // Generate the payload and start transmitting
    if (currentAppMode() != TX_UNDERFLOW) { // Force underflows in this mode
      // Load packet data before transmitting if manual loading is not enabled
      if (!txFifoManual) {
        loadTxData(txData, txDataLen);
      }
    }

    bool reuseCcaConfig = !((startTransmitCounter == storedTransmitCounter)
                            && (failPackets == 0));

    txStatus = chooseTxType(reuseCcaConfig);

    if (txStatus != 0) {
      lastTxStatus = txStatus;
      failPackets++;
      scheduleNextTx(); // No callback will fire, so fake it
    } else if (currentAppMode() == TX_CANCEL) {
      usDelay(txCancelDelay);
      RAIL_Idle(railHandle, RAIL_IDLE_ABORT, false);
    }
  }
}

void pendFinishTxSequence()
{
  finishTxSequence = true;
}

void pendFinishTxAckSequence()
{
  finishTxAckSequence = true;
}

void finishTxSequenceIfPending()
{
  if (finishTxSequence) {
    finishTxSequence = false;

    if (logLevel & ASYNC_RESPONSE) {
      // Compute the number of packets sent
      uint32_t sentPackets = internalTransmitCounter - startTransmitCounter;
      // Print the number of sent and failed packets
      responsePrint("txEnd",
                    "txStatus:%s,"
                    "transmitted:%u,"
                    "lastTxTime:%u,"
                    "failed:%u,"
                    "lastTxStatus:0x%x,"
                    "isAck:False",
                    failPackets == 0
                    ? "Complete"
                    : (sentPackets == 0 ? "Error" : "Partial"),
                    sentPackets,
                    previousTxAppendedInfo.timeSent.packetTime,
                    failPackets,
                    lastTxStatus);
    }
    startTransmitCounter = internalTransmitCounter;
    failPackets = 0;
    lastTxStatus = 0;
  }
  if (finishTxAckSequence) {
    finishTxAckSequence = false;

    if ((logLevel & ASYNC_RESPONSE) && printTxAck) {
      // Print the number of sent and failed packets
      responsePrint("txEnd",
                    "txStatus:%s,"
                    "transmitted:%u,"
                    "lastTxTime:%u,"
                    "failed:%u,"
                    "lastTxStatus:0x%x,"
                    "isAck:True",
                    failAckPackets == 0
                    ? "Complete"
                    : (sentAckPackets == 0 ? "Error" : "Partial"),
                    sentAckPackets,
                    previousTxAckAppendedInfo.timeSent.packetTime,
                    failAckPackets,
                    lastTxAckStatus);
    }
    sentAckPackets = 0;
    failAckPackets = 0;
    lastTxAckStatus = 0;
  }
}

void printReceivedPacket()
{
  // Print any newly received packets
  if (!queueIsEmpty(&rxPacketQueue)) {
    void *rxPacketHandle = queueRemove(&rxPacketQueue);
    RxPacketData_t *rxPacketData =
      (RxPacketData_t*) memoryPtrFromHandle(rxPacketHandle);

    // Print the received packet and appended info
    if (rxPacketData != NULL) {
      printPacket("rxPacket",
                  rxPacketData->dataPtr,
                  rxPacketData->dataLength,
                  rxPacketData);
    }
    // Free the memory allocated for this packet since we're now done with it
    memoryFree(rxPacketHandle);
  }
}

void printPacket(char *cmdName,
                 uint8_t *data,
                 uint16_t dataLength,
                 RxPacketData_t *packetData)
{
  uint32_t offset = 0;
  int i;

  // Print out a length 0 packet message if no packet was given
  if (data == NULL) {
    responsePrint(cmdName, "len:0");
    return;
  }

  for (i = 0; i < dataLength; i++) {
    int n = snprintf(packetPrintBuffer + offset,
                     sizeof(packetPrintBuffer) - offset,
                     " 0x%.2x",
                     data[i]);
    if (n >= 0) {
      offset += n;
    } else {
      snprintf(packetPrintBuffer, sizeof(packetPrintBuffer), "Invalid Packet");
      break;
    }

    // If we've filled up the packet buffer make sure we stop trying to print
    if (offset >= sizeof(packetPrintBuffer)) {
      snprintf(packetPrintBuffer,
               sizeof(packetPrintBuffer),
               "Packet too large!");
      break;
    }
  }

  // If this is an Rx packet print the appended info
  if (packetData != NULL) {
    responsePrint(cmdName,
                  "len:%d,timeUs:%u,crc:%s,rssi:%d,lqi:%d,phy:%d,isAck:%s,syncWordId:%d,payload:%s",
                  packetData->dataLength,
                  packetData->appendedInfo.timeReceived.packetTime,
                  (packetData->appendedInfo.crcPassed) ? "Pass" : "Fail",
                  packetData->appendedInfo.rssi,
                  packetData->appendedInfo.lqi,
                  packetData->appendedInfo.subPhyId,
                  packetData->appendedInfo.isAck ? "True" : "False",
                  packetData->appendedInfo.syncWordId,
                  packetPrintBuffer);
  } else {
    responsePrint(cmdName, "len:%d,payload:%s", dataLength, packetPrintBuffer);
  }
}

void processInputCharacters()
{
  char input = getchar();
  while (input != '\0' && input != 0xFF) {
    if (localEcho) {
      if (input != '\n') {
        printf("%c", input);
      }
    }
    if (ciProcessInput(&ciState, &input, 1) > 0) {
      printf("> ");
    }
    input = getchar();
  }
}

void enqueueEvents(RAIL_Events_t events)
{
  if (enablePrintEvents & events) {
    // Disable interrupts to avoid the risk of trying to enqueueing
    // two callbacks at once.
    CORE_DECLARE_IRQ_STATE;
    CORE_ENTER_CRITICAL();
    if (eventQueueMarker < EVENT_QUEUE_SIZE) {
      eventQueue[eventQueueMarker].timestamp = RAIL_GetTime();
      eventQueue[eventQueueMarker].events = events;
      eventQueueMarker++;
    } else {
      eventsMissed++;
    }
    CORE_EXIT_CRITICAL();
  }
}

