thinnect/tos-platforms/tos/platforms/efm32/radio/rail_lib/apps/railtest/app_main.c
// Allows for a consistent way of printing events in the order
// they were called, regardless of when they occur in the main
// loop.
void printEvents(void)
{
  EventData_t cacheEventQueue[EVENT_QUEUE_SIZE];
  uint8_t cacheEventQueueMarker = 0;
  uint32_t cacheEventsMissed = 0;

  if (eventQueueMarker) {
    // We don't want more callbacks added as we print
    CORE_DECLARE_IRQ_STATE;
    CORE_ENTER_CRITICAL();

    // cache the eventQueue
    memcpy(cacheEventQueue, eventQueue, sizeof(eventQueue));

    // cache the eventQueueMarker
    cacheEventQueueMarker = eventQueueMarker;

    // resetting the eventQueueMarker - don't need to clear
    // the actual queue, resetting the marker will just let us overwrite it
    eventQueueMarker = 0;

    cacheEventsMissed = eventsMissed;
    eventsMissed = 0;

    CORE_EXIT_CRITICAL();

    for (int position = 0; position < cacheEventQueueMarker; position++) {
      // Within each entry, check each potential bit
      RAIL_Events_t events = cacheEventQueue[position].events;
      for (int i = 0; (events >> i) != 0; i++) {
        if (events & (1 << i)) {
          responsePrint("event",
                        "timestamp:%d,eventName:RAIL_EVENT_%s",
                        cacheEventQueue[position].timestamp,
                        eventNames[i]);
        }
      }
    }
    if (cacheEventsMissed) {
      responsePrintError("printEventsMissed",
                         0x36,
                         "Event queue limited to %d callbacks. %d callbacks not enqueued.",
                         EVENT_QUEUE_SIZE,
                         cacheEventsMissed);
    }
  }
}

/******************************************************************************
 * Command Interpreter Override Functions
 *****************************************************************************/

// Error callback function using responsePrint
void ciErrorCallback(char* command, CommandError_t error)
{
  if (error == CI_UNKNOWN_COMMAND) {
    responsePrintError("ci",
                       CI_UNKNOWN_COMMAND,
                       "Unknown command '%s'",
                       command);
  } else if (error == CI_MAX_ARGUMENTS) {
    responsePrintError("ci",
                       CI_MAX_ARGUMENTS,
                       "CI_MAX_ARGUMENTS '%s'",
                       command);
  } else if (error == CI_INVALID_ARGUMENTS) {
    responsePrintError("ci",
                       CI_INVALID_ARGUMENTS,
                       "Invalid arguments for '%s'",
                       command);
  }
}

#ifdef USE_RESPONSE_HELP
// Help callback function using responsePrint
bool ciPrintHelp(CommandEntry_t *commands)
{
  responsePrintHeader("help", "command:%s,args:%s,help:%s");
  while (commands != NULL && commands->command != NULL) {
    char *args = commands->arguments;
    char *helpStr = commands->helpStr;

    if (commands->callback != NULL) {
      // Make sure that we print something for NULL pointers
      if (args == NULL) {
        args = "";
      }
      if (helpStr == NULL) {
        helpStr = "";
      }

      // Print the multiline response for this entry
      responsePrintMulti("command:%s,args:%s,help:%s",
                         commands->command,
                         args,
                         helpStr);
    }
    commands++;
  }
  return true;
}
#endif //USE_RESPONSE_HELP
